; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	satellite2 - satellite
	instrument6 - instrument
	instrument7 - instrument
	instrument8 - instrument
	image0 - mode
	spectrograph1 - mode
	GroundStation0 - direction
	GroundStation5 - direction
	GroundStation8 - direction
	GroundStation7 - direction
	GroundStation10 - direction
	Star4 - direction
	Star2 - direction
	Star9 - direction
	GroundStation6 - direction
	GroundStation3 - direction
	Star1 - direction
	Star11 - direction
	Phenomenon12 - direction
	Planet13 - direction
	Star14 - direction
	Planet15 - direction
	Planet16 - direction
	Star17 - direction
	Planet18 - direction
)
(:init
	(supports instrument0 image0)
	(calibration_target instrument0 Star4)
	(calibration_target instrument0 GroundStation8)
	(calibration_target instrument0 GroundStation7)
	(supports instrument1 spectrograph1)
	(supports instrument1 image0)
	(calibration_target instrument1 Star1)
	(calibration_target instrument1 GroundStation3)
	(supports instrument2 image0)
	(supports instrument2 spectrograph1)
	(calibration_target instrument2 Star1)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star11)
	(supports instrument3 spectrograph1)
	(supports instrument3 image0)
	(calibration_target instrument3 Star9)
	(calibration_target instrument3 Star4)
	(supports instrument4 image0)
	(supports instrument4 spectrograph1)
	(calibration_target instrument4 Star2)
	(calibration_target instrument4 GroundStation7)
	(supports instrument5 image0)
	(supports instrument5 spectrograph1)
	(calibration_target instrument5 GroundStation10)
	(calibration_target instrument5 Star1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star4)
	(supports instrument6 spectrograph1)
	(supports instrument6 image0)
	(calibration_target instrument6 Star2)
	(calibration_target instrument6 Star4)
	(calibration_target instrument6 GroundStation10)
	(supports instrument7 spectrograph1)
	(supports instrument7 image0)
	(calibration_target instrument7 Star9)
	(supports instrument8 image0)
	(supports instrument8 spectrograph1)
	(calibration_target instrument8 Star1)
	(calibration_target instrument8 GroundStation3)
	(calibration_target instrument8 GroundStation6)
	(on_board instrument6 satellite2)
	(on_board instrument7 satellite2)
	(on_board instrument8 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon12)
)
(:goal (and
	(pointing satellite0 Planet18)
	(have_image Star11 image0)
	(have_image Phenomenon12 image0)
	(have_image Planet13 spectrograph1)
	(have_image Star14 image0)
	(have_image Planet15 spectrograph1)
	(have_image Planet16 spectrograph1)
	(have_image Star17 spectrograph1)
	(have_image Planet18 spectrograph1)
))

)

; plan
1. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 0 of 9
2. (calibrate satellite1 instrument3 star4)
   added: (calibrated instrument3)
   goals met: 0 of 9
3. (turn_to satellite1 planet16 star4)
   deleted: (pointing satellite1 star4)
   added: (pointing satellite1 planet16)
   goals met: 0 of 9
4. (take_image satellite1 planet16 instrument3 spectrograph1)
   added: (have_image planet16 spectrograph1)
   goals met: 1 of 9
5. (turn_to satellite1 planet15 planet16)
   deleted: (pointing satellite1 planet16)
   added: (pointing satellite1 planet15)
   goals met: 1 of 9
6. (take_image satellite1 planet15 instrument3 spectrograph1)
   added: (have_image planet15 spectrograph1)
   goals met: 2 of 9
7. (turn_to satellite1 planet13 planet15)
   deleted: (pointing satellite1 planet15)
   added: (pointing satellite1 planet13)
   goals met: 2 of 9
8. (take_image satellite1 planet13 instrument3 spectrograph1)
   added: (have_image planet13 spectrograph1)
   goals met: 3 of 9
9. (turn_to satellite1 phenomenon12 planet13)
   deleted: (pointing satellite1 planet13)
   added: (pointing satellite1 phenomenon12)
   goals met: 3 of 9
10. (take_image satellite1 phenomenon12 instrument3 image0)
   added: (have_image phenomenon12 image0)
   goals met: 4 of 9
11. (turn_to satellite0 planet18 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 planet18)
   goals met: 5 of 9
12. (turn_to satellite1 planet18 phenomenon12)
   deleted: (pointing satellite1 phenomenon12)
   added: (pointing satellite1 planet18)
   goals met: 5 of 9
13. (take_image satellite1 planet18 instrument3 spectrograph1)
   added: (have_image planet18 spectrograph1)
   goals met: 6 of 9
14. (turn_to satellite1 star11 planet18)
   deleted: (pointing satellite1 planet18)
   added: (pointing satellite1 star11)
   goals met: 6 of 9
15. (take_image satellite1 star11 instrument3 image0)
   added: (have_image star11 image0)
   goals met: 7 of 9
16. (turn_to satellite1 star14 star11)
   deleted: (pointing satellite1 star11)
   added: (pointing satellite1 star14)
   goals met: 7 of 9
17. (take_image satellite1 star14 instrument3 image0)
   added: (have_image star14 image0)
   goals met: 8 of 9
18. (turn_to satellite1 star17 star14)
   deleted: (pointing satellite1 star14)
   added: (pointing satellite1 star17)
   goals met: 8 of 9
19. (take_image satellite1 star17 instrument3 spectrograph1)
   added: (have_image star17 spectrograph1)
   goals met: 9 of 9
